tests/xma/4.1/xma_ProvAPI/ProvisioningCore-API/addDeviceNull.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://provisioning.intf.mobilgw.com/">
  <soap:Body>
    <tns:addDevice>
      <arg0>
        <profile/>
        <profileUrl/>
        <userAgent/>
      </arg0>
    </tns:addDevice>
  </soap:Body>
</soap:Envelope>